#### Part 7

In [1]:
import pandas as pd

In [2]:
smple_data = {
    'name': ['Suminder', 'Nimrat', 'Deepi', 'Anuj'],
    'last': ['Singh', 'Kaur', 'Kaur', 'Kour'],
    'salary': [70000, 125000, 56000, 120000]
}

dta = pd.DataFrame(smple_data)

In [3]:
dta

       name   last  salary
0  Suminder  Singh   70000
1    Nimrat   Kaur  125000
2     Deepi   Kaur   56000
3      Anuj   Kour  120000

In [4]:
dta['full_name'] = dta['name'] + ' ' + dta['last']

In [5]:
dta

       name   last  salary       full_name
0  Suminder  Singh   70000  Suminder Singh
1    Nimrat   Kaur  125000     Nimrat Kaur
2     Deepi   Kaur   56000      Deepi Kaur
3      Anuj   Kour  120000       Anuj Kour

In [6]:
dta.rename({'name': 'first'}, axis='columns', inplace=True)

In [7]:
dta

      first   last  salary       full_name
0  Suminder  Singh   70000  Suminder Singh
1    Nimrat   Kaur  125000     Nimrat Kaur
2     Deepi   Kaur   56000      Deepi Kaur
3      Anuj   Kour  120000       Anuj Kour

In [8]:
dta.sort_values(by = ['first', 'last'], ascending = True)

      first   last  salary       full_name
3      Anuj   Kour  120000       Anuj Kour
2     Deepi   Kaur   56000      Deepi Kaur
1    Nimrat   Kaur  125000     Nimrat Kaur
0  Suminder  Singh   70000  Suminder Singh

In [9]:
df = pd.read_csv('/home/noor/Documents/survey_results_public.csv')
schema_df = pd.read_csv('/home/noor/Documents/survey_results_schema.csv', index_col = 'Column')

In [10]:
schema_df.head(3)

                                                 QuestionText
Column
Respondent  Randomized respondent ID number (not in order ...
MainBranch  Which of the following options best describes ...
Hobbyist                              Do you code as a hobby?

In [16]:
schema_df.columns = [i.capitalize() for i in schema_df.columns]

In [17]:
schema_df.head(3)

                                                 Questiontext
Column
Respondent  Randomized respondent ID number (not in order ...
MainBranch  Which of the following options best describes ...
Hobbyist                              Do you code as a hobby?

In [18]:
dta

      first   last  salary       full_name
0  Suminder  Singh   70000  Suminder Singh
1    Nimrat   Kaur  125000     Nimrat Kaur
2     Deepi   Kaur   56000      Deepi Kaur
3      Anuj   Kour  120000       Anuj Kour

In [23]:
dta[['fn', 'ln']] = dta['full_name'].str.split(" ", expand = True)

In [24]:
dta.columns

Index(['first', 'last', 'salary', 'full_name', 'fn', 'ln'], dtype='object')

In [25]:
dta

      first   last  salary       full_name        fn     ln
0  Suminder  Singh   70000  Suminder Singh  Suminder  Singh
1    Nimrat   Kaur  125000     Nimrat Kaur    Nimrat   Kaur
2     Deepi   Kaur   56000      Deepi Kaur     Deepi   Kaur
3      Anuj   Kour  120000       Anuj Kour      Anuj   Kour

In [38]:
df.head(3)

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
1,2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Web development or web design,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult

In [39]:
dta.nlargest(2, 'salary')

    first  last  salary    full_name      fn    ln
1  Nimrat  Kaur  125000  Nimrat Kaur  Nimrat  Kaur
3    Anuj  Kour  120000    Anuj Kour    Anuj  Kour

In [40]:
dta.salary.nlargest(2)

1    125000
3    120000
Name: salary, dtype: int64

In [42]:
dta.salary.nsmallest(1)

2    56000
Name: salary, dtype: int64

In [43]:
dta.nsmallest(1, 'salary')

   first  last  salary   full_name     fn    ln
2  Deepi  Kaur   56000  Deepi Kaur  Deepi  Kaur

In [44]:
df.columns

Index(['Respondent', 'MainBranch', 'Hobbyist', 'OpenSourcer', 'OpenSource',
       'Employment', 'Country', 'Student', 'EdLevel', 'UndergradMajor',
       'EduOther', 'OrgSize', 'DevType', 'YearsCode', 'Age1stCode',
       'YearsCodePro', 'CareerSat', 'JobSat', 'MgrIdiot', 'MgrMoney',
       'MgrWant', 'JobSeek', 'LastHireDate', 'LastInt', 'FizzBuzz',
       'JobFactors', 'ResumeUpdate', 'CurrencySymbol', 'CurrencyDesc',
       'CompTotal', 'CompFreq', 'ConvertedComp', 'WorkWeekHrs', 'WorkPlan',
       'WorkChallenge', 'WorkRemote', 'WorkLoc', 'ImpSyn', 'CodeRev',
       'CodeRevHrs', 'UnitTests', 'PurchaseHow', 'PurchaseWhat',
       'LanguageWorkedWith', 'LanguageDesireNextYear', 'DatabaseWorkedWith',
       'DatabaseDesireNextYear', 'PlatformWorkedWith',
       'PlatformDesireNextYear', 'WebFrameWorkedWith',
       'WebFrameDesireNextYear', 'MiscTechWorkedWith',
       'MiscTechDesireNextYear', 'DevEnviron', 'OpSys', 'Containers',
       'BlockchainOrg', 'BlockchainIs', 'BetterLife', 'ITperson', 'OffOn',
       'SocialMedia', 'Extraversion', 'ScreenName', 'SOVisit1st',
       'SOVisitFreq', 'SOVisitTo', 'SOFindAnswer', 'SOTimeSaved',
       'SOHowMuchTime', 'SOAccount', 'SOPartFreq', 'SOJobs', 'EntTeams',
       'SOComm', 'WelcomeChange', 'SONewContent', 'Age', 'Gender', 'Trans',
       'Sexuality', 'Ethnicity', 'Dependents', 'SurveyLength', 'SurveyEase'],
      dtype='object')

In [50]:
schema_df.loc['Hobbyist', 'Questiontext']

'Do you code as a hobby?'

In [60]:
df.sort_values(by = ['Country', 'ConvertedComp'], ascending = [True, False]).loc[:, ['Respondent', 'Country', 'ConvertedComp']][df.ConvertedComp == 1000000].head(3)

<ipython-input-60-10efb0b2d799>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df.sort_values(by = ['Country', 'ConvertedComp'], ascending = [True, False]).loc[:, ['Respondent', 'Country', 'ConvertedComp']][df.ConvertedComp == 1000000].head(3)

       Respondent      Country  ConvertedComp
62723       63129  Afghanistan      1000000.0
68151       68589      Algeria      1000000.0
784           787    Australia      1000000.0

In [61]:
df.ConvertedComp.median()

57287.0

In [62]:
df.ConvertedComp.mean()

127110.73842323056

In [63]:
df.median()

Respondent       44442.0
CompTotal        62000.0
ConvertedComp    57287.0
WorkWeekHrs         40.0
CodeRevHrs           4.0
Age                 29.0
dtype: float64

In [65]:
df.describe()

,Respondent,CompTotal,ConvertedComp,WorkWeekHrs,CodeRevHrs,Age
count,88883.000000,5.594500e+04,5.582300e+04,64503.000000,49790.000000,79210.000000
mean,44442.000000,5.519014e+11,1.271107e+05,42.127197,5.084308,30.336699
std,25658.456325,7.331926e+13,2.841523e+05,37.287610,5.513931,9.178390
min,1.000000,0.000000e+00,0.000000e+00,1.000000,0.000000,1.000000
25%,22221.500000,2.000000e+04,2.577750e+04,40.000000,2.000000,24.000000
50%,44442.000000,6.200000e+04,5.728700e+04,40.000000,4.000000,29.000000
75%,66662.500000,1.200000e+05,1.000000e+05,44.750000,6.000000,35.000000
max,88883.000000,1.000000e+16,2.000000e+06,4850.000000,99.000000,99.000000

In [66]:
df.ConvertedComp.describe()

count    5.582300e+04
mean     1.271107e+05
std      2.841523e+05
min      0.000000e+00
25%      2.577750e+04
50%      5.728700e+04
75%      1.000000e+05
max      2.000000e+06
Name: ConvertedComp, dtype: float64